namespace DogLiveBot.Data.Menu;

public static class MessageText
{
    public static readonly string CompleteShortRegistration = "Пройдите короткую регистрацию. Она поможет записаться на занятия в пару кликов.";
    public static readonly string UserIsAlreadyRegistered = "Пользователь уже зарегистрирован";
    public static readonly string YouHaveSuccessfullyRegistered = "Вы успешно зарегистрировались, теперь можно записаться на занятие";
    
    public static readonly string Rules = 
        "\u2757\ufe0f\u2757\ufe0fПравила Центра дрессировки Dog Live \u2757\ufe0f\u2757\ufe0f\n\n" +
        "Часы работы с 9.00 - 21.00.\nВ выходные с 9.00- 17.00\nПонедельник выходной \n\nПрайс лист " +
        "\n1 занятия: 550\n4 занятия: 1900\n8 занятий: 3800\n12 занятий: 5800\nЦена на групповое занятия также 550" +
        "\nЗанятия без тренера 300 рублей с 1 собаки. " +
        "\n\n\ud83d\udd8d\ufe0fЗанятия только по предварительной записи. В группе пишим дату, время, кличку. " +
        "\n\ud83d\udd8d\ufe0fОтмена занятия не позднее, чем за 12 часов. Если вы не приезжаете в назначенное вами время," +
        " то занятие оплачивается полностью." +
        " \n\ud83d\udd8d\ufe0f Приобретенный абонемент даётся на месяц. Семинары не засчитываются в этот период." +
        "\n\ud83d\udd8d\ufe0fБез обязательной вакцинации собачки не принимаются на занятия " +
        "\n\ud83d\udd8d\ufe0fВыгул собак разрешается только, при въезде на территорию и не в коем случае  на площадке " +
        "и возле входа в зал. Если случаются такие неприятности в не положенном месте вы должны убрать за своей собачкой." +
        "\n\ud83d\udd8d\ufe0fПорядок и чистота в зале также должна поддерживаться. Если случаются казусы, то Вы должны " +
        " брать с собой, пелёнки,  влажные салфетки и пакеты для уборки. И должным образом  убрать за своей собачкой , " +
        "тренер этого НЕ  ДЕЛАЕТ \u2757\ufe0f \n\ud83d\udd8d\ufe0f Негативное обсуждение других собак , хозяев и людей строго запрещены в чате." +
        "\n\n\ud83d\udd8d\ufe0f *С СОБОЙ НА ТРЕНИРОВКУ У ВАС ДОЛЖНО БЫТЬ*: \nСобачка голодная, норма кормления с собой" +
        " мясо ( любые потроха которые ест собака) игрушки, сменную обувь, ошейник, поводок. Если собачка агрессивная, то намордник. ";

    public static readonly string SpecifyDogName = "Укажите кличку собаки:";
    public static readonly string SpecifyName = "Укажите имя:";
    public static readonly string UserSettings = "\u2699\ufe0f Настройки:";
    public static readonly string SelectAction = "Выберите действие";
}